(artillery) result_without_consoleLog.log
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 23:30:17(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 23:30:18(-0300)

All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 23:30:20(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 991/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 11
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 7.9
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 41.8
  max: ......................................................................... 174.6
  median: ...................................................................... 135.7
  p95: ......................................................................... 169
  p99: ......................................................................... 172.5